Тест/Тест/src/Documents/ЗакупкаТовара/ЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТовара</name>
  <basedOn>Document.ЗаявкаЗакупкаТовара</basedOn>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаЗакупкаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.ТранспротнаяКомпания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрекНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Т_Т</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Т</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Т_Д</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Д</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправления</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПрибытия</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗакупки</name>
    <type>
      <types>EnumRef.СтатусыЗаявкаЗакупкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗабралиВТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗабралиВТК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПоступления</name>
      <type>
        <types>EnumRef.СтатусЗакупкиТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеДетали</name>
      <type>
        <types>CatalogRef.ПроектыРазработки</types>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>String</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБЕЗНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/CommonForms/УправлениеЛогистикой/Module.bsl
&НаКлиенте
Процедура ЗабралиВТК(Команда)
	ЗаказТовараСсылка = ЭтаФорма.Элементы.СписокЗабрать.ТекущиеДанные.ЗаказЗапчастей; 
	ЗабралиВТКНаСервере(ЗаказТовараСсылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗабралиВТКНаСервере(ЗаказТовараСсылка)
	ОбъектЗаказЗапчастей = ЗаказТовараСсылка.ПолучитьОбъект(); 
	ОбъектЗаказЗапчастей.ЗабралиВТК = Истина; 
	ОбъектЗаказЗапчастей.ДатаЗабралиВТК = ТекущаяДатаСеанса(); 
	
	ТекстЛога =  "----------------------------------------------------" + Символы.ПС + ТекущаяДатаСеанса() 
	+ Символы.ПС + Пользователи.ТекущийПользователь() + Символы.ПС +" Установил галку ""Забрали в ТК"" "+  Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакупкаТовара.Логи
		|ИЗ
		|	Документ.ЗакупкаТовара КАК ЗакупкаТовара
		|ГДЕ
		|	ЗакупкаТовара.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказТовараСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекстЛога = Выборка.логи + ТекстЛога; 
	КонецЕсли; 
	
	ОбъектЗаказЗапчастей.Логи = ТекстЛога; 
	ОбъектЗаказЗапчастей.Записать(); 
КонецПроцедуры
